digital_twin_dynamic/estimators/predictor_default_latency/llama-3.1-8b-instruct/output/_50__1_400/log_20810728.out
INFO 05-11 13:22:36 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='openai', base_url=None, host='localhost', port=36232, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path=None, model='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-3.1-8b-instruct', tokenizer=None, num_prompts=4096, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, request_rate=inf, request_rate_by_lora=None, seed=0, trust_remote_code=False, disable_tqdm=True, save_result=True, metadata=None, result_dir='digital_twin_dynamic/estimators/predictor_default_latency/llama-3.1-8b/output/_50__1_400', launch_server=True, server_args='--port=36232 --disable-log-requests --model="/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-3.1-8b-instruct" --scheduler-cls="vllm.v1.core.sched.scheduler.Scheduler" --no-enable-prefix-caching --max-num-seqs=50', server_init_time=300, disable_log_stats=False, disable_loras_users=True, user_lora_request_relation=None, restrict_loras=None, lora_pre_loading=False, use_synthetic_dataset='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/data/common_american_words.txt', synthetic_input_length=1, synthetic_output_length=400)
All available words: 63366
Generated prompt with 5 input length: Swoon.
Server started
Starting initial single prompt test run for base model
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     4096      
Benchmark duration (s):                  465.11    
Total input tokens:                      20480     
Total generated tokens:                  1638478   
Request throughput (req/s):              8.81      
Input token throughput (tok/s):          44.03     
Output token throughput (tok/s):         3522.80   
---------------Time to First Token----------------
Mean TTFT (ms):                          230026.79 
Median TTFT (ms):                        228084.74 
P99 TTFT (ms):                           456757.32 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          14.04     
Median TPOT (ms):                        14.06     
P99 TPOT (ms):                           14.08     
---------------Inter-token Latency----------------
Mean ITL (ms):                           14.09     
Median ITL (ms):                         14.02     
P99 ITL (ms):                            15.11     
==================================================
Concurrent checker terminated
Server terminated